Engimusing/engimusing-firmware/cores/efm32/efm_lib/analog.h
#define _ADC_SINGLECTRL_PRSSEL_MASK               0x30000000          // Bit mask for ADC_PRSSEL
#define _ADC_SINGLECTRL_PRSSEL_SHIFT                      28          // Shift value for ADC_PRSSEL
#define ADC_SINGLECTRL_PRSSEL_PRSCH0             (0x0 << 28)          // Shifted mode PRSCH0 for ADC_SINGLECTRL
#define ADC_SINGLECTRL_PRSSEL_PRSCH1             (0x1 << 28)          // Shifted mode PRSCH1 for ADC_SINGLECTRL
#define ADC_SINGLECTRL_PRSSEL_PRSCH2             (0x2 << 28)          // Shifted mode PRSCH2 for ADC_SINGLECTRL
#define ADC_SINGLECTRL_PRSSEL_PRSCH3             (0x3 << 28)          // Shifted mode PRSCH3 for ADC_SINGLECTRL

// Bit fields for ADC SCANCTRL
#define ADC_SCANCTRL_REP                        (0x1UL << 0)          // Scan Sequence Repetitive Mode
#define ADC_SCANCTRL_DIFF                       (0x1UL << 1)          // Scan Sequence Differential Mode
#define ADC_SCANCTRL_ADJ                        (0x1UL << 2)          // Scan Sequence Result Adjustment
#define _ADC_SCANCTRL_ADJ_MASK                           0x4          // Bit mask for ADC_ADJ
#define _ADC_SCANCTRL_ADJ_SHIFT                            2          // Shift value for ADC_ADJ
#define ADC_SCANCTRL_ADJ_RIGHT                    (0x0 << 2)          // Shifted mode RIGHT for ADC_SCANCTRL
#define ADC_SCANCTRL_ADJ_LEFT                     (0x1 << 2)          // Shifted mode LEFT for ADC_SCANCTRL

#define _ADC_SCANCTRL_RES_MASK                          0x30          // Bit mask for ADC_RES
#define _ADC_SCANCTRL_RES_SHIFT                            4          // Shift value for ADC_RES
#define ADC_SCANCTRL_RES_12BIT                    (0x0 << 4)          // Shifted mode 12BIT for ADC_SCANCTRL
#define ADC_SCANCTRL_RES_8BIT                     (0x1 << 4)          // Shifted mode 8BIT for ADC_SCANCTRL
#define ADC_SCANCTRL_RES_6BIT                     (0x2 << 4)          // Shifted mode 6BIT for ADC_SCANCTRL
#define ADC_SCANCTRL_RES_OVS                      (0x3 << 4)          // Shifted mode OVS for ADC_SCANCTRL

#define _ADC_SCANCTRL_INPUTMASK_MASK                  0xFF00          // Bit mask for ADC_INPUTMASK
#define _ADC_SCANCTRL_INPUTMASK_SHIFT                      8          // Shift value for ADC_INPUTMASK
#define ADC_SCANCTRL_INPUTMASK_CH0               (0x01 << 8)          // Shifted mode CH0 for ADC_SCANCTRL
#define ADC_SCANCTRL_INPUTMASK_CH1               (0x02 << 8)          // Shifted mode CH1 for ADC_SCANCTRL
#define ADC_SCANCTRL_INPUTMASK_CH2               (0x04 << 8)          // Shifted mode CH2 for ADC_SCANCTRL
#define ADC_SCANCTRL_INPUTMASK_CH3               (0x08 << 8)          // Shifted mode CH3 for ADC_SCANCTRL
#define ADC_SCANCTRL_INPUTMASK_CH4               (0x10 << 8)          // Shifted mode CH4 for ADC_SCANCTRL
#define ADC_SCANCTRL_INPUTMASK_CH5               (0x20 << 8)          // Shifted mode CH5 for ADC_SCANCTRL
#define ADC_SCANCTRL_INPUTMASK_CH6               (0x40 << 8)          // Shifted mode CH6 for ADC_SCANCTRL
#define ADC_SCANCTRL_INPUTMASK_CH7               (0x80 << 8)          // Shifted mode CH7 for ADC_SCANCTRL

#define _ADC_SCANCTRL_REF_SHIFT                          16           // Shift value for ADC_REF
#define _ADC_SCANCTRL_REF_MASK                      0x70000           // Bit mask for ADC_REF
#define ADC_SCANCTRL_REF_1V25                   (0x0 << 16)           // Shifted mode 1V25 for ADC_SCANCTRL
#define ADC_SCANCTRL_REF_2V5                    (0x1 << 16)           // Shifted mode 2V5 for ADC_SCANCTRL
#define ADC_SCANCTRL_REF_VDD                    (0x2 << 16)           // Shifted mode VDD for ADC_SCANCTRL
#define ADC_SCANCTRL_REF_5VDIFF                 (0x3 << 16)           // Shifted mode 5VDIFF for ADC_SCANCTRL
#define ADC_SCANCTRL_REF_EXTSINGLE              (0x4 << 16)           // Shifted mode EXTSINGLE for ADC_SCANCTRL
#define ADC_SCANCTRL_REF_2XEXTDIFF              (0x5 << 16)           // Shifted mode 2XEXTDIFF for ADC_SCANCTRL
#define ADC_SCANCTRL_REF_2XVDD                  (0x6 << 16)           // Shifted mode 2XVDD for ADC_SCANCTRL

#define _ADC_SCANCTRL_AT_SHIFT                           20           // Shift value for ADC_AT
#define _ADC_SCANCTRL_AT_MASK                      0xF00000           // Bit mask for ADC_AT
#define ADC_SCANCTRL_AT_1CYCLE                  (0x0 << 20)           // Shifted mode 1CYCLE for ADC_SCANCTRL
#define ADC_SCANCTRL_AT_2CYCLES                 (0x1 << 20)           // Shifted mode 2CYCLES for ADC_SCANCTRL
#define ADC_SCANCTRL_AT_4CYCLES                 (0x2 << 20)           // Shifted mode 4CYCLES for ADC_SCANCTRL
#define ADC_SCANCTRL_AT_8CYCLES                 (0x3 << 20)           // Shifted mode 8CYCLES for ADC_SCANCTRL
#define ADC_SCANCTRL_AT_16CYCLES                (0x4 << 20)           // Shifted mode 16CYCLES for ADC_SCANCTRL
#define ADC_SCANCTRL_AT_32CYCLES                (0x5 << 20)           // Shifted mode 32CYCLES for ADC_SCANCTRL
#define ADC_SCANCTRL_AT_64CYCLES                (0x6 << 20)           // Shifted mode 64CYCLES for ADC_SCANCTRL
#define ADC_SCANCTRL_AT_128CYCLES               (0x7 << 20)           // Shifted mode 128CYCLES for ADC_SCANCTRL
#define ADC_SCANCTRL_AT_256CYCLES               (0x8 << 20)           // Shifted mode 256CYCLES for ADC_SCANCTRL

#define ADC_SCANCTRL_PRSEN                    (0x1UL << 24)           // Scan Sequence PRS Trigger Enable

#define _ADC_SCANCTRL_PRSSEL_SHIFT                       28           // Shift value for ADC_PRSSEL
#define _ADC_SCANCTRL_PRSSEL_MASK                0x30000000           // Bit mask for ADC_PRSSEL
#define ADC_SCANCTRL_PRSSEL_PRSCH0              (0x0 << 28)           // Shifted mode PRSCH0 for ADC_SCANCTRL
#define ADC_SCANCTRL_PRSSEL_PRSCH1              (0x1 << 28)           // Shifted mode PRSCH1 for ADC_SCANCTRL
#define ADC_SCANCTRL_PRSSEL_PRSCH2              (0x2 << 28)           // Shifted mode PRSCH2 for ADC_SCANCTRL
#define ADC_SCANCTRL_PRSSEL_PRSCH3              (0x3 << 28)           // Shifted mode PRSCH3 for ADC_SCANCTRL

// Bit fields for ADC IEN
#define ADC_IEN_SINGLE                         (0x1UL << 0)           // Single Conversion Complete Interrupt Enable
#define ADC_IEN_SCAN                           (0x1UL << 1)           // Scan Conversion Complete Interrupt Enable
#define ADC_IEN_SINGLEOF                       (0x1UL << 8)           // Single Result Overflow Interrupt Enable
#define ADC_IEN_SCANOF                         (0x1UL << 9)           // Scan Result Overflow Interrupt Enable

