Engimusing/engimusing-firmware/cores/efm32/efm_lib/analog.h
// Bit fields for ADC IF
#define ADC_IF_SINGLE                          (0x1UL << 0)           // Single Conversion Complete Interrupt Flag
#define ADC_IF_SCAN                            (0x1UL << 1)           // Scan Conversion Complete Interrupt Flag
#define ADC_IF_SINGLEOF                        (0x1UL << 8)           // Single Result Overflow Interrupt Flag
#define ADC_IF_SCANOF                          (0x1UL << 9)           // Scan Result Overflow Interrupt Flag

// Bit fields for ADC IFS
#define ADC_IFS_SINGLE                         (0x1UL << 0)           // Single Conversion Complete Interrupt Flag Set
#define ADC_IFS_SCAN                           (0x1UL << 1)           // Scan Conversion Complete Interrupt Flag Set
#define ADC_IFS_SINGLEOF                       (0x1UL << 8)           // Single Result Overflow Interrupt Flag Set
#define ADC_IFS_SCANOF                         (0x1UL << 9)           // Scan Result Overflow Interrupt Flag Set

// Bit fields for ADC IFC
#define ADC_IFC_SINGLE                         (0x1UL << 0)           // Single Conversion Complete Interrupt Flag Clear
#define ADC_IFC_SCAN                           (0x1UL << 1)           // Scan Conversion Complete Interrupt Flag Clear
#define ADC_IFC_SINGLEOF                       (0x1UL << 8)           // Single Result Overflow Interrupt Flag Clear
#define ADC_IFC_SCANOF                         (0x1UL << 9)           // Scan Result Overflow Interrupt Flag Clear

// Bit fields for ADC SINGLEDATA
#define _ADC_SINGLEDATA_MASK                     0xFFFFFFFF           // Mask for ADC_SINGLEDATA

// Bit fields for ADC SCANDATA
#define _ADC_SCANDATA_MASK                       0xFFFFFFFF           // Mask for ADC_SCANDATA

// Bit fields for ADC SINGLEDATAP
#define _ADC_SINGLEDATAP_MASK                    0xFFFFFFFF           // Mask for ADC_SINGLEDATAP

// Bit fields for ADC SCANDATAP
#define _ADC_SCANDATAP_MASK                      0xFFFFFFFF           // Mask for ADC_SCANDATAP

// Bit fields for ADC CAL
#define _ADC_CAL_SINGLEOFFSET_MASK                     0x7F           // Bit mask for ADC_SINGLEOFFSET
#define _ADC_CAL_SINGLEGAIN_SHIFT                         8           // Shift value for ADC_SINGLEGAIN
#define _ADC_CAL_SINGLEGAIN_MASK                     0x7F00           // Bit mask for ADC_SINGLEGAIN
#define _ADC_CAL_SCANOFFSET_SHIFT                        16           // Shift value for ADC_SCANOFFSET
#define _ADC_CAL_SCANOFFSET_MASK                   0x7F0000           // Bit mask for ADC_SCANOFFSET
#define _ADC_CAL_SCANGAIN_SHIFT                          24           // Shift value for ADC_SCANGAIN
#define _ADC_CAL_SCANGAIN_MASK                   0x7F000000           // Bit mask for ADC_SCANGAIN

// Bit fields for ADC BIASPROG
#define _ADC_BIASPROG_BIASPROG_SHIFT                      0           // Shift value for ADC_BIASPROG
#define _ADC_BIASPROG_BIASPROG_MASK                     0xF           // Bit mask for ADC_BIASPROG
#define ADC_BIASPROG_HALFBIAS                    (0x1 << 6)           // Half Bias Current
#define _ADC_BIASPROG_HALFBIAS_SHIFT                      6           // Shift value for ADC_HALFBIAS
#define _ADC_BIASPROG_HALFBIAS_MASK                    0x40           // Bit mask for ADC_HALFBIAS
#define _ADC_BIASPROG_COMPBIAS_SHIFT                      8           // Shift value for ADC_COMPBIAS
#define _ADC_BIASPROG_COMPBIAS_MASK                   0xF00           // Bit mask for ADC_COMPBIAS
*/


//#endif
